/* 1.EVA  TV二周目done,目前死与新生
2.RE0   第一季二周目半途，待补
3.咒术回战  done
4.天元突破  第一集
5.HF剧场版  第二部+第三部未看
6.寒蝉本篇二周目+新篇   本篇第一季二周目半途，待补,实在看不动
7.超炮第三季补完   done
8.空之境界二周目   
9.异度侵入
10.数码宝贝大冒号
11.方舟剧情  7-6
12.柯南    940话 考虑补经典集数
13.海贼王  12话
14.尼尔  序章
15.白色相簿2  序章
16.爱死机第二季 done
17.三月的狮子
18.来自深渊第二季 第一话开始追更
19.路人女主第二季
20.岸边露伴一一动不动
21.重启咲良田   13话
22.紫罗兰永恒花园TV+剧场版
23. kill la kill 
24 惊天魔盗团 
25 冰与火之歌
26 神探夏洛克
27 沉默的羔羊 done
28 梦比优斯
29 鱿鱼游戏   done
30 魔法纪录   第二季第七话
31 JOJO6 12话
32 蝴蝶效应 done
33 鬼灭之刃第二季  第六集
34 心慌方 done
35 夏日重现 第八话开始追更
36 爱死机第三季 done 
37 86不存在的战区
38 崩坏3往世乐土 主线30章
39 赛马娘  第二季第1话
40 SAO进击篇剧场版
41 Lycoris 第一季第二话
42 魔法禁书目录  
*/
 